# Taps
tap "agentic-utils/tap"
tap "antoniorodr/memo"
tap "finnvoor/tools"
tap "hashicorp/tap"
tap "kubegraf/tap"
tap "opencode-ai/tap"
tap "oven-sh/bun"
tap "steipete/tap"

# Shell
brew "direnv"
brew "fd"
brew "fnm"
brew "fzf"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "watch"

# Dev tools
brew "gh"
brew "go"
brew "hugo"
brew "jq"
brew "neovim"
brew "yq"
brew "oven-sh/bun/bun"

# Kubernetes
brew "argocd"
brew "helm"
brew "k9s"
brew "kubectx"
brew "kubegraf/tap/kubegraf"
brew "stern"

# Cloud & Infra
brew "awscli"
brew "hashicorp/tap/terraform"
brew "opentofu"
brew "terraform-docs"
brew "tflint"

# AI tools
brew "agentic-utils/tap/ccs"
brew "ccusage"
brew "opencode"

# Misc CLI
brew "agg"
brew "antoniorodr/memo/memo"
brew "asciinema"
brew "finnvoor/tools/yap"
brew "frpc"
brew "redis"
brew "steipete/tap/remindctl"
brew "steipete/tap/wacli"

# Casks
cask "1password-cli"
cask "codex"
cask "container"
cask "iterm2"
cask "zed"
